// SHA2 Supported 64-bit versions

// Version 10.20.18029 (March 2020)
// File SHA1 = 3603f260d52c62962ed3ec902e0b7122585ecee9
//
// Version 10.20.18038 (April 2020)
// File SHA1 = c541f9d57c09c87ab4901c51602f6d466e09781f
//
// Version 10.20.18040 (June 2020)
// File SHA1 = f621beaaacbcee09d5e2c037fe4b93145edf677e
//
// Version 10.20.18053 (September/October 2020)
// File SHA1 = b2dd6f7c38e08344dc8ffa44f4ce8c29e4dc6d9f

// SHA2 Supported 32-bit versions

// Version 10.20.18049 (June 2020)
// File SHA1 = 9e2dcac6aeccd618304d373c3e2d5af0a9f59421
//
// Version 10.20.18053 (September/October 2020)
// File SHA1 = 63441491ba3709d55b8801265d898edda38bfcae


DeviceInfo
| where Timestamp > ago (1d)
| where OSVersion == "6.1"
| join kind=inner (
    DeviceProcessEvents
    | where Timestamp > ago (1d)
    | where InitiatingProcessFileName == "MonitoringHost.exe"
    | where InitiatingProcessSHA1 != ""
    ) on DeviceId
| extend Version=replace(@'d97f5f336628d2d7c7a0860086aae8a7895fe09c', @'10.19.10006, Non-compliant', InitiatingProcessSHA1) 
| extend Version=replace(@'ef6204ae26f2aab0fe3a89991a6c97b71a17f231', @'8.0.11136, Non-compliant', Version)
| extend Version=replace(@'97d537c4015bc561eb4f2c70cdec0fbab41dec5f', @'8.0.11103, Non-compliant', Version)
| extend Version=replace(@'9e2dcac6aeccd618304d373c3e2d5af0a9f59421', @'10.20.18049, Compliant', Version)
| extend Version=replace(@'227fffb434c6f1f10614b12a3139ed51c492dcb6', @'8.0.13053, Non-compliant', Version)
| extend Version=replace(@'651ebf94d7c6120bd45a917a06a391e53534993e', @'8.0.11136, Non-compliant', Version)
| extend Version=replace(@'9eab7e74fe1d8dbd4346a1d7566df0c4b8521613', @'8.0.11103, Non-compliant', Version)
| extend Version=replace(@'ec7da62769bb05b7fbc15c67601813cf053dcff1', @'10.20.18011, Non-compliant', Version)
| extend Version=replace(@'113ef00207692c8f9c575f14c3109a78a7dbe6b8', @'10.20.18018, Non-compliant', Version)
| extend Version=replace(@'3b57539cb6fcfdaf7e10eee46240a404df1fb1ab', @'10.20.18001, Non-compliant', Version)
| extend Version=replace(@'f621beaaacbcee09d5e2c037fe4b93145edf677e', @'10.20.18040, Compliant', Version)
| extend Version=replace(@'c541f9d57c09c87ab4901c51602f6d466e09781f', @'10.20.18038, Compliant', Version)
| extend Version=replace(@'3603f260d52c62962ed3ec902e0b7122585ecee9', @'10.20.18029, Compliant', Version)
| extend Version=replace(@'05e5a781b55265ad5a55c8e84b8142bd9c56e1bd', @'10.19.10006, Non-compliant', Version)
| extend Version=replace(@'25158c85889aecf3406fef741b08a64ca3b39073', @'10.19.13515, Non-compliant', Version)
| extend Version=replace(@'a499b163138e882b6440f0a31b36e7ffaf515597', @'10.19.10014, Non-compliant', Version)
| extend Version=replace(@'6d455aad1244c2d38b5257912756a1570d927516', @'8.0.13053, Non-compliant', Version)
| extend Version=replace(@'3cfead2c7c204f481d60f13332bd7f9addf74c34', @'8.0.10918, Non-compliant', Version)
| extend Version=replace(@'ddbe499dfa696a5a2bbf46248fff5e0c98df9e01', @'8.0.11081, Non-compliant', Version)
| extend Version=replace(@'d6c7667df1e099dfcd2d5739c56c3481f7b4fbf1', @'8.0.11072, Non-compliant', Version)
| extend Version=replace(@'b2dd6f7c38e08344dc8ffa44f4ce8c29e4dc6d9f', @'10.20.18053, Compliant', Version)
| extend Version=replace(@'63441491ba3709d55b8801265d898edda38bfcae', @'10.20.18053, Compliant', Version)
| summarize arg_max(Version, *) by DeviceId
| project DeviceName, Version
